app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2010-05-18 07:46:48', 'ZDZDC', '2010-05-18 07:46:48', NULL)
---
def create
  @post = Post.find(params[:post_id])
  @comment = @post.comments.create!(params[:comment])