app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "other") VALUES('2010-05-18 04:14:14', 'qewwq', 'qeq', '2010-05-18 04:14:14', NULL)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2010-05-18 03:56:02', "title" = 'Hellozvzxcv' WHERE "id" = 1